[Survived] ObjectLiteral
src/app.ts:21:23
 }
 
 export async function buildApp(options: BuildAppOptions = {}): Promise<FastifyInstance> {
-  const app = Fastify({
-    logger: options.logger ?? true,
-  })
+  const app = Fastify({})
 
   await registerEnvironment(app)

[Survived] LogicalOperator
src/app.ts:22:13
 
 export async function buildApp(options: BuildAppOptions = {}): Promise<FastifyInstance> {
   const app = Fastify({
-    logger: options.logger ?? true,
+    logger: options.logger && true,
   })
 

[Survived] BooleanLiteral
src/app.ts:22:31
 
 export async function buildApp(options: BuildAppOptions = {}): Promise<FastifyInstance> {
   const app = Fastify({
-    logger: options.logger ?? true,
+    logger: options.logger ?? false,
   })
 

[Killed] StringLiteral
src/app.ts:43:52
   await registerCors(app)
 
   await app.register(healthRoutes)
-  await app.register(registerAuthRoutes, { prefix: '/api/auth' })
+  await app.register(registerAuthRoutes, { prefix: "" })
   await app.register(registerTodo)
 
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ObjectLiteral
src/app.ts:43:42
   await registerCors(app)
 
   await app.register(healthRoutes)
-  await app.register(registerAuthRoutes, { prefix: '/api/auth' })
+  await app.register(registerAuthRoutes, {})
   await app.register(registerTodo)
 
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 401 to be 201 // Object.is equality
