[Killed] BlockStatement
src/features/auth/auth.handler.ts:10:5
   async register(
     request: FastifyRequest<{ Body: { email?: string; password?: string } }>,
     reply: FastifyReply,
-  ) {
-    const { email, password } = request.body
-
-    if (!email || !password) {
-      throw new BadRequestError('Email and password are required')
-    }
-
-    const existingUser = await userRepository.findByEmail(email)
-    if (existingUser) {
-      throw new BadRequestError('Email already registered')
-    }
-
-    const passwordHash = await bcrypt.hash(password, 10)
-    const user = await userRepository.create({ email, passwordHash })
-
-    return reply.status(201).send({
-      message: 'User registered successfully',
-      userId: user.id,
-    })
-  },
+  ) {},
 
   async login(
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 200 to be 201 // Object.is equality

[Killed] LogicalOperator
src/features/auth/auth.handler.ts:13:9
   ) {
     const { email, password } = request.body
 
-    if (!email || !password) {
+    if (!email && !password) {
       throw new BadRequestError('Email and password are required')
     }
killedBy: Authentication Integration POST /api/auth/register should return 400 when email or password missing
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/features/auth/auth.handler.ts:13:9
   ) {
     const { email, password } = request.body
 
-    if (!email || !password) {
+    if (true) {
       throw new BadRequestError('Email and password are required')
     }
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/features/auth/auth.handler.ts:18:9
     }
 
     const existingUser = await userRepository.findByEmail(email)
-    if (existingUser) {
+    if (false) {
       throw new BadRequestError('Email already registered')
     }
killedBy: Authentication Integration POST /api/auth/register should return 400 when email already exists
statusReason: expected 201 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/features/auth/auth.handler.ts:18:9
     }
 
     const existingUser = await userRepository.findByEmail(email)
-    if (existingUser) {
+    if (true) {
       throw new BadRequestError('Email already registered')
     }
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ObjectLiteral
src/features/auth/auth.handler.ts:23:46
     }
 
     const passwordHash = await bcrypt.hash(password, 10)
-    const user = await userRepository.create({ email, passwordHash })
+    const user = await userRepository.create({})
 
     return reply.status(201).send({
killedBy: Authentication Integration POST /api/auth/register should return 400 when email already exists
statusReason: expected 201 to be 400 // Object.is equality

[Killed] ObjectLiteral
src/features/auth/auth.handler.ts:25:35
     const passwordHash = await bcrypt.hash(password, 10)
     const user = await userRepository.create({ email, passwordHash })
 
-    return reply.status(201).send({
-      message: 'User registered successfully',
-      userId: user.id,
-    })
+    return reply.status(201).send({})
   },
 
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected {} to have property "message" with value 'User registered successfully'

[Killed] BlockStatement
src/features/auth/auth.handler.ts:34:5
   async login(
     request: FastifyRequest<{ Body: { email?: string; password?: string } }>,
     reply: FastifyReply,
-  ) {
-    const { email, password } = request.body
-
-    if (!email || !password) {
-      throw new BadRequestError('Email and password are required')
-    }
-
-    const user = await userRepository.findByEmail(email)
-    if (!user) {
-      throw new UnauthorizedError('Invalid credentials')
-    }
-
-    const isPasswordValid = await bcrypt.compare(password, user.passwordHash)
-    if (!isPasswordValid) {
-      throw new UnauthorizedError('Invalid credentials')
-    }
-
-    const token = reply.server.jwt.sign({ sub: user.id, email: user.email })
-
-    return reply.send({ token })
-  },
+  ) {},
 }
 
killedBy: Authentication Integration POST /api/auth/login should login successfully with valid credentials
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/features/auth/auth.handler.ts:37:30
   ) {
     const { email, password } = request.body
 
-    if (!email || !password) {
-      throw new BadRequestError('Email and password are required')
-    }
+    if (!email || !password) {}
 
     const user = await userRepository.findByEmail(email)
killedBy: authHandler login should throw BadRequestError if email or password missing
statusReason: expected error to be instance of BadRequestError

[Killed] ConditionalExpression
src/features/auth/auth.handler.ts:42:9
     }
 
     const user = await userRepository.findByEmail(email)
-    if (!user) {
+    if (true) {
       throw new UnauthorizedError('Invalid credentials')
     }
killedBy: Authentication Integration POST /api/auth/login should login successfully with valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/features/auth/auth.handler.ts:42:9
     }
 
     const user = await userRepository.findByEmail(email)
-    if (!user) {
+    if (false) {
       throw new UnauthorizedError('Invalid credentials')
     }
killedBy: Authentication Integration POST /api/auth/login should login successfully with valid credentials
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/features/auth/auth.handler.ts:47:9
     }
 
     const isPasswordValid = await bcrypt.compare(password, user.passwordHash)
-    if (!isPasswordValid) {
+    if (false) {
       throw new UnauthorizedError('Invalid credentials')
     }
killedBy: Authentication Integration POST /api/auth/login should login successfully with valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BlockStatement
src/features/auth/auth.handler.ts:47:27
     }
 
     const isPasswordValid = await bcrypt.compare(password, user.passwordHash)
-    if (!isPasswordValid) {
-      throw new UnauthorizedError('Invalid credentials')
-    }
+    if (!isPasswordValid) {}
 
     const token = reply.server.jwt.sign({ sub: user.id, email: user.email })
killedBy: authHandler login should throw UnauthorizedError if password invalid
statusReason: promise resolved "{ status: [Function Mock], …(2) }" instead of rejecting

[Killed] ObjectLiteral
src/features/auth/auth.handler.ts:53:23
 
     const token = reply.server.jwt.sign({ sub: user.id, email: user.email })
 
-    return reply.send({ token })
+    return reply.send({})
   },
 }
killedBy: Authentication Integration POST /api/auth/login should login successfully with valid credentials
statusReason: expected 401 to be 200 // Object.is equality
