[Killed] BlockStatement
src/config/environment.ts:60:80
   }
 }
 
-export async function registerEnvironment(app: FastifyInstance): Promise<void> {
-  await app.register(fastifyEnv, {
-    schema: environmentSchema,
-    dotenv: true,
-  })
-}
+export async function registerEnvironment(app: FastifyInstance): Promise<void> {}
 
killedBy: error handler should return consistent JSON for HttpError; error handler should return 500 for unexpected errors; error handler should return 400 for validation errors
statusReason: Cannot read properties of undefined (reading 'MONGODB_URI')

[Survived] BooleanLiteral
src/config/environment.ts:63:13
 export async function registerEnvironment(app: FastifyInstance): Promise<void> {
   await app.register(fastifyEnv, {
     schema: environmentSchema,
-    dotenv: true,
+    dotenv: false,
   })
 }
