[Killed] BlockStatement
src/features/auth/auth.route.ts:4:79
 import type { FastifyInstance } from 'fastify'
 import { authHandler } from './auth.handler.js'
 
-export async function registerAuthRoutes(app: FastifyInstance): Promise<void> {
-  app.post('/register', { config: { public: true } }, authHandler.register)
-  app.post('/login', { config: { public: true } }, authHandler.login)
-}
+export async function registerAuthRoutes(app: FastifyInstance): Promise<void> {}
 
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 401 to be 201 // Object.is equality

[Killed] BooleanLiteral
src/features/auth/auth.route.ts:5:45
 import { authHandler } from './auth.handler.js'
 
 export async function registerAuthRoutes(app: FastifyInstance): Promise<void> {
-  app.post('/register', { config: { public: true } }, authHandler.register)
+  app.post('/register', { config: { public: false } }, authHandler.register)
   app.post('/login', { config: { public: true } }, authHandler.login)
 }
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ObjectLiteral
src/features/auth/auth.route.ts:5:35
 import { authHandler } from './auth.handler.js'
 
 export async function registerAuthRoutes(app: FastifyInstance): Promise<void> {
-  app.post('/register', { config: { public: true } }, authHandler.register)
+  app.post('/register', { config: {} }, authHandler.register)
   app.post('/login', { config: { public: true } }, authHandler.login)
 }
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 401 to be 201 // Object.is equality

[Killed] BooleanLiteral
src/features/auth/auth.route.ts:6:42
 
 export async function registerAuthRoutes(app: FastifyInstance): Promise<void> {
   app.post('/register', { config: { public: true } }, authHandler.register)
-  app.post('/login', { config: { public: true } }, authHandler.login)
+  app.post('/login', { config: { public: false } }, authHandler.login)
 }
 
killedBy: Authentication Integration POST /api/auth/login should login successfully with valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] StringLiteral
src/features/auth/auth.route.ts:6:12
 
 export async function registerAuthRoutes(app: FastifyInstance): Promise<void> {
   app.post('/register', { config: { public: true } }, authHandler.register)
-  app.post('/login', { config: { public: true } }, authHandler.login)
+  app.post("", { config: { public: true } }, authHandler.login)
 }
 
killedBy: Authentication Integration POST /api/auth/login should login successfully with valid credentials
statusReason: expected 401 to be 200 // Object.is equality
