[Killed] BlockStatement
src/plugins/auth.plugin.ts:6:58
 import { UnauthorizedError } from '../shared/errors/http-error.js'
 import '../shared/types/index.js'
 
-function isPublicRoute(request: FastifyRequest): boolean {
-  return request.routeOptions.config.public === true || request.url.startsWith('/docs')
-}
+function isPublicRoute(request: FastifyRequest): boolean {}
 
 async function authHook(request: FastifyRequest, _reply: FastifyReply): Promise<void> {
killedBy: Todo Integration Tests should create a todo
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/plugins/auth.plugin.ts:7:10
 import '../shared/types/index.js'
 
 function isPublicRoute(request: FastifyRequest): boolean {
-  return request.routeOptions.config.public === true || request.url.startsWith('/docs')
+  return false
 }
 
killedBy: Todo Integration Tests should create a todo
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/plugins/auth.plugin.ts:7:10
 import '../shared/types/index.js'
 
 function isPublicRoute(request: FastifyRequest): boolean {
-  return request.routeOptions.config.public === true || request.url.startsWith('/docs')
+  return false || request.url.startsWith('/docs')
 }
 
killedBy: Todo Integration Tests should create a todo
statusReason: expected 401 to be 201 // Object.is equality

[Killed] BlockStatement
src/plugins/auth.plugin.ts:10:87
   return request.routeOptions.config.public === true || request.url.startsWith('/docs')
 }
 
-async function authHook(request: FastifyRequest, _reply: FastifyReply): Promise<void> {
-  if (isPublicRoute(request)) {
-    return
-  }
-
-  try {
-    await request.jwtVerify()
-  } catch {
-    throw new UnauthorizedError('Authentication required')
-  }
-}
+async function authHook(request: FastifyRequest, _reply: FastifyReply): Promise<void> {}
 
 async function authPlugin(app: FastifyInstance): Promise<void> {
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 404 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/plugins/auth.plugin.ts:11:7
 }
 
 async function authHook(request: FastifyRequest, _reply: FastifyReply): Promise<void> {
-  if (isPublicRoute(request)) {
+  if (false) {
     return
   }
killedBy: Todo Integration Tests should create a todo
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/plugins/auth.plugin.ts:11:7
 }
 
 async function authHook(request: FastifyRequest, _reply: FastifyReply): Promise<void> {
-  if (isPublicRoute(request)) {
+  if (true) {
     return
   }
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 404 to be 401 // Object.is equality

[Killed] BlockStatement
src/plugins/auth.plugin.ts:15:7
     return
   }
 
-  try {
-    await request.jwtVerify()
-  } catch {
+  try {} catch {
     throw new UnauthorizedError('Authentication required')
   }
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 404 to be 401 // Object.is equality

[Killed] BlockStatement
src/plugins/auth.plugin.ts:17:11
 
   try {
     await request.jwtVerify()
-  } catch {
-    throw new UnauthorizedError('Authentication required')
-  }
+  } catch {}
 }
 
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 404 to be 401 // Object.is equality

[Survived] StringLiteral
src/plugins/auth.plugin.ts:18:33
   try {
     await request.jwtVerify()
   } catch {
-    throw new UnauthorizedError('Authentication required')
+    throw new UnauthorizedError("")
   }
 }

[Killed] BlockStatement
src/plugins/auth.plugin.ts:22:64
   }
 }
 
-async function authPlugin(app: FastifyInstance): Promise<void> {
-  app.addHook('onRequest', authHook)
-}
+async function authPlugin(app: FastifyInstance): Promise<void> {}
 
 export const registerAuth = fp(authPlugin, {
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 404 to be 401 // Object.is equality

[Survived] StringLiteral
src/plugins/auth.plugin.ts:27:9
 }
 
 export const registerAuth = fp(authPlugin, {
-  name: 'auth-plugin',
+  name: "",
 })
 
