[Killed] BlockStatement
src/domain/todo-id.ts:6:34
 export class TodoId {
   private constructor(private readonly value: string) {}
 
-  public static create(): TodoId {
-    return new TodoId(uuidv4())
-  }
+  public static create(): TodoId {}
 
   public static fromString(value: string): TodoId {
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BlockStatement
src/domain/todo-id.ts:10:51
     return new TodoId(uuidv4())
   }
 
-  public static fromString(value: string): TodoId {
-    if (!uuidValidate(value)) {
-      throw new Error('Invalid TodoId')
-    }
-    return new TodoId(value)
-  }
+  public static fromString(value: string): TodoId {}
 
   public toString(): string {
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/domain/todo-id.ts:11:9
   }
 
   public static fromString(value: string): TodoId {
-    if (!uuidValidate(value)) {
+    if (false) {
       throw new Error('Invalid TodoId')
     }
killedBy: Todo Integration Tests should return 400 when deleting with invalid id
statusReason: expected 204 to be 400 // Object.is equality

[Killed] BooleanLiteral
src/domain/todo-id.ts:11:9
   }
 
   public static fromString(value: string): TodoId {
-    if (!uuidValidate(value)) {
+    if (uuidValidate(value)) {
       throw new Error('Invalid TodoId')
     }
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/domain/todo-id.ts:17:29
     return new TodoId(value)
   }
 
-  public toString(): string {
-    return this.value
-  }
+  public toString(): string {}
 
   public equals(other: TodoId): boolean {
killedBy: Todo Integration Tests should create a todo
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/domain/todo-id.ts:21:41
     return this.value
   }
 
-  public equals(other: TodoId): boolean {
-    return this.value === other.value
-  }
+  public equals(other: TodoId): boolean {}
 }
 
killedBy: TodoId should check for equality
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/domain/todo-id.ts:22:12
   }
 
   public equals(other: TodoId): boolean {
-    return this.value === other.value
+    return true
   }
 }
killedBy: TodoId should check for equality
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/domain/todo-id.ts:22:12
   }
 
   public equals(other: TodoId): boolean {
-    return this.value === other.value
+    return this.value !== other.value
   }
 }
killedBy: TodoId should check for equality
statusReason: expected false to be true // Object.is equality
