[Killed] BlockStatement
src/domain/todo-title.ts:4:54
 export class TodoTitle {
   private constructor(private readonly value: string) {}
 
-  public static fromString(value: string): TodoTitle {
-    if (value.length === 0) {
-      throw new Error('Todo title cannot be empty')
-    }
-    if (value.length > 255) {
-      throw new Error('Todo title is too long')
-    }
-    return new TodoTitle(value)
-  }
+  public static fromString(value: string): TodoTitle {}
 
   public toString(): string {
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality

[Killed] EqualityOperator
src/domain/todo-title.ts:5:9
   private constructor(private readonly value: string) {}
 
   public static fromString(value: string): TodoTitle {
-    if (value.length === 0) {
+    if (value.length !== 0) {
       throw new Error('Todo title cannot be empty')
     }
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/domain/todo-title.ts:5:9
   private constructor(private readonly value: string) {}
 
   public static fromString(value: string): TodoTitle {
-    if (value.length === 0) {
+    if (true) {
       throw new Error('Todo title cannot be empty')
     }
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality

[Killed] EqualityOperator
src/domain/todo-title.ts:8:9
     if (value.length === 0) {
       throw new Error('Todo title cannot be empty')
     }
-    if (value.length > 255) {
+    if (value.length <= 255) {
       throw new Error('Todo title is too long')
     }
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BlockStatement
src/domain/todo-title.ts:8:29
     if (value.length === 0) {
       throw new Error('Todo title cannot be empty')
     }
-    if (value.length > 255) {
-      throw new Error('Todo title is too long')
-    }
+    if (value.length > 255) {}
     return new TodoTitle(value)
   }
killedBy: TodoTitle should throw error if title is too long
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/todo-title.ts:18:44
     return this.value
   }
 
-  public equals(other: TodoTitle): boolean {
-    return this.value === other.value
-  }
+  public equals(other: TodoTitle): boolean {}
 }
 
killedBy: TodoTitle should check for equality
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/domain/todo-title.ts:19:12
   }
 
   public equals(other: TodoTitle): boolean {
-    return this.value === other.value
+    return true
   }
 }
killedBy: TodoTitle should check for equality
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/domain/todo-title.ts:19:12
   }
 
   public equals(other: TodoTitle): boolean {
-    return this.value === other.value
+    return this.value !== other.value
   }
 }
killedBy: TodoTitle should check for equality
statusReason: expected false to be true // Object.is equality
