[Killed] BlockStatement
src/domain/todo.ts:10:32
     public readonly updatedAt: Date,
   ) {}
 
-  static now(): TodoTimestamps {
-    const now = new Date()
-    return new TodoTimestamps(now, now)
-  }
+  static now(): TodoTimestamps {}
 
   update(): TodoTimestamps {
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BlockStatement
src/domain/todo.ts:15:28
     return new TodoTimestamps(now, now)
   }
 
-  update(): TodoTimestamps {
-    return new TodoTimestamps(this.createdAt, new Date())
-  }
+  update(): TodoTimestamps {}
 }
 
killedBy: Todo Integration Tests should update a todo
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/domain/todo.ts:40:41
     private details: TodoDetails,
   ) {}
 
-  static create(title: TodoTitle): Todo {
-    const status = new TodoStatus(false, TodoTimestamps.now())
-    const details = new TodoDetails(title, status)
-    return new Todo(TodoId.create(), details)
-  }
+  static create(title: TodoTitle): Todo {}
 
   complete(): void {
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BooleanLiteral
src/domain/todo.ts:41:35
   ) {}
 
   static create(title: TodoTitle): Todo {
-    const status = new TodoStatus(false, TodoTimestamps.now())
+    const status = new TodoStatus(true, TodoTimestamps.now())
     const details = new TodoDetails(title, status)
     return new Todo(TodoId.create(), details)
killedBy: UpdateTodoUseCase should update only title
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/domain/todo.ts:46:20
     return new Todo(TodoId.create(), details)
   }
 
-  complete(): void {
-    const newStatus = new TodoStatus(true, this.details.status.timestamps.update())
-    this.details = new TodoDetails(this.details.title, newStatus)
-  }
+  complete(): void {}
 
   updateTitle(title: TodoTitle): void {
killedBy: Todo Integration Tests should update a todo
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/domain/todo.ts:47:38
   }
 
   complete(): void {
-    const newStatus = new TodoStatus(true, this.details.status.timestamps.update())
+    const newStatus = new TodoStatus(false, this.details.status.timestamps.update())
     this.details = new TodoDetails(this.details.title, newStatus)
   }
killedBy: Todo Integration Tests should update a todo
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/domain/todo.ts:51:39
     this.details = new TodoDetails(this.details.title, newStatus)
   }
 
-  updateTitle(title: TodoTitle): void {
-    const newStatus = new TodoStatus(
-      this.details.status.completed,
-      this.details.status.timestamps.update(),
-    )
-    this.details = new TodoDetails(title, newStatus)
-  }
+  updateTitle(title: TodoTitle): void {}
 
   toJSON() {
killedBy: Todo Integration Tests should update a todo
statusReason: expected 'Update me' to be 'Updated title' // Object.is equality

[Killed] BlockStatement
src/domain/todo.ts:59:12
     this.details = new TodoDetails(title, newStatus)
   }
 
-  toJSON() {
-    return {
-      id: this.id.toString(),
-      title: this.details.title.toString(),
-      completed: this.details.status.completed,
-      createdAt: this.details.status.timestamps.createdAt,
-      updatedAt: this.details.status.timestamps.updatedAt,
-    }
-  }
+  toJSON() {}
 }
 
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality
