[Killed] BlockStatement
src/features/health/health.handler.ts:8:98
   database: string
 }
 
-export async function healthHandler(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-  let databaseStatus = 'ok'
-  try {
-    await request.server.db.command({ ping: 1 })
-  } catch (error) {
-    databaseStatus = 'error'
-    request.log.error(error, 'Database health check failed')
-  }
-
-  const response: HealthResponse = {
-    status: databaseStatus === 'ok' ? 'ok' : 'error',
-    database: databaseStatus,
-  }
-
-  const statusCode = response.status === 'ok' ? 200 : 503
-  await reply.status(statusCode).send(response)
-}
+export async function healthHandler(request: FastifyRequest, reply: FastifyReply): Promise<void> {}
 
killedBy: GET /health should return 200 with status ok
statusReason: Unexpected end of JSON input

[Survived] BlockStatement
src/features/health/health.handler.ts:10:7
 
 export async function healthHandler(request: FastifyRequest, reply: FastifyReply): Promise<void> {
   let databaseStatus = 'ok'
-  try {
-    await request.server.db.command({ ping: 1 })
-  } catch (error) {
+  try {} catch (error) {
     databaseStatus = 'error'
     request.log.error(error, 'Database health check failed')

[NoCoverage] BlockStatement
src/features/health/health.handler.ts:12:19
   let databaseStatus = 'ok'
   try {
     await request.server.db.command({ ping: 1 })
-  } catch (error) {
-    databaseStatus = 'error'
-    request.log.error(error, 'Database health check failed')
-  }
+  } catch (error) {}
 
   const response: HealthResponse = {

[Killed] EqualityOperator
src/features/health/health.handler.ts:18:13
   }
 
   const response: HealthResponse = {
-    status: databaseStatus === 'ok' ? 'ok' : 'error',
+    status: databaseStatus !== 'ok' ? 'ok' : 'error',
     database: databaseStatus,
   }
killedBy: buildApp should register the health route
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/features/health/health.handler.ts:18:13
   }
 
   const response: HealthResponse = {
-    status: databaseStatus === 'ok' ? 'ok' : 'error',
+    status: false ? 'ok' : 'error',
     database: databaseStatus,
   }
killedBy: buildApp should register the health route
statusReason: expected 503 to be 200 // Object.is equality

[Killed] EqualityOperator
src/features/health/health.handler.ts:22:22
     database: databaseStatus,
   }
 
-  const statusCode = response.status === 'ok' ? 200 : 503
+  const statusCode = response.status !== 'ok' ? 200 : 503
   await reply.status(statusCode).send(response)
 }
killedBy: buildApp should register the health route
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/features/health/health.handler.ts:22:22
     database: databaseStatus,
   }
 
-  const statusCode = response.status === 'ok' ? 200 : 503
+  const statusCode = false ? 200 : 503
   await reply.status(statusCode).send(response)
 }
killedBy: buildApp should register the health route
statusReason: expected 503 to be 200 // Object.is equality
