[Killed] BlockStatement
src/features/health/health.route.ts:5:73
 import { healthHandler } from './health.handler.js'
 import '../../shared/types/index.js'
 
-export async function healthRoutes(app: FastifyInstance): Promise<void> {
-  app.get(
-    '/health',
-    {
-      config: { public: true },
-      schema: {
-        description: 'Check application health status',
-        tags: ['System'],
-        response: {
-          200: {
-            description: 'Successful health check',
-            type: 'object',
-            properties: {
-              status: { type: 'string', example: 'ok' },
-              database: { type: 'string', example: 'ok' },
-            },
-          },
-        },
-      },
-    },
-    healthHandler,
-  )
-}
+export async function healthRoutes(app: FastifyInstance): Promise<void> {}
 
killedBy: buildApp should register the health route
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/features/health/health.route.ts:9:25
   app.get(
     '/health',
     {
-      config: { public: true },
+      config: { public: false },
       schema: {
         description: 'Check application health status',
killedBy: buildApp should register the health route
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/features/health/health.route.ts:9:15
   app.get(
     '/health',
     {
-      config: { public: true },
+      config: {},
       schema: {
         description: 'Check application health status',
killedBy: GET /health should return 200 with status ok
statusReason: expected 401 to be 200 // Object.is equality

[Survived] ObjectLiteral
src/features/health/health.route.ts:10:15
     '/health',
     {
       config: { public: true },
-      schema: {
-        description: 'Check application health status',
-        tags: ['System'],
-        response: {
-          200: {
-            description: 'Successful health check',
-            type: 'object',
-            properties: {
-              status: { type: 'string', example: 'ok' },
-              database: { type: 'string', example: 'ok' },
-            },
-          },
-        },
-      },
+      schema: {},
     },
     healthHandler,

[Survived] StringLiteral
src/features/health/health.route.ts:11:22
     {
       config: { public: true },
       schema: {
-        description: 'Check application health status',
+        description: "",
         tags: ['System'],
         response: {

[Survived] ObjectLiteral
src/features/health/health.route.ts:14:16
         description: 'Check application health status',
         tags: ['System'],
         response: {
-          200: {
-            description: 'Successful health check',
-            type: 'object',
-            properties: {
-              status: { type: 'string', example: 'ok' },
-              database: { type: 'string', example: 'ok' },
-            },
-          },
+          200: {},
         },
       },

[Survived] StringLiteral
src/features/health/health.route.ts:15:26
         tags: ['System'],
         response: {
           200: {
-            description: 'Successful health check',
+            description: "",
             type: 'object',
             properties: {

[Survived] StringLiteral
src/features/health/health.route.ts:18:50
             description: 'Successful health check',
             type: 'object',
             properties: {
-              status: { type: 'string', example: 'ok' },
+              status: { type: 'string', example: "" },
               database: { type: 'string', example: 'ok' },
             },

[Survived] ObjectLiteral
src/features/health/health.route.ts:18:23
             description: 'Successful health check',
             type: 'object',
             properties: {
-              status: { type: 'string', example: 'ok' },
+              status: {},
               database: { type: 'string', example: 'ok' },
             },

[Killed] StringLiteral
src/features/health/health.route.ts:19:33
             type: 'object',
             properties: {
               status: { type: 'string', example: 'ok' },
-              database: { type: 'string', example: 'ok' },
+              database: { type: "", example: 'ok' },
             },
           },
killedBy: GET /health should return 200 with status ok
statusReason: Failed building the serialization schema for GET: /health, due to error schema is invalid: data/properties/database/type must be equal to one of the allowed values

[Survived] ObjectLiteral
src/features/health/health.route.ts:19:25
             type: 'object',
             properties: {
               status: { type: 'string', example: 'ok' },
-              database: { type: 'string', example: 'ok' },
+              database: {},
             },
           },
