[Killed] BlockStatement
src/features/todo/todo.controller.ts:16:43
   private readonly updateTodoUseCase: UpdateTodoUseCase
   private readonly deleteTodoUseCase: DeleteTodoUseCase
 
-  constructor(repository: TodoRepository) {
-    this.createTodoUseCase = new CreateTodoUseCase(repository)
-    this.getTodosUseCase = new GetTodosUseCase(repository)
-    this.getTodoByIdUseCase = new GetTodoByIdUseCase(repository)
-    this.updateTodoUseCase = new UpdateTodoUseCase(repository)
-    this.deleteTodoUseCase = new DeleteTodoUseCase(repository)
-  }
+  constructor(repository: TodoRepository) {}
 
   async create(request: FastifyRequest<{ Body: { title: string } }>, reply: FastifyReply) {
killedBy: Todo Integration Tests should create a todo
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BlockStatement
src/features/todo/todo.controller.ts:24:91
     this.deleteTodoUseCase = new DeleteTodoUseCase(repository)
   }
 
-  async create(request: FastifyRequest<{ Body: { title: string } }>, reply: FastifyReply) {
-    const result = await this.createTodoUseCase.execute(request.body)
-    return reply.status(201).send(result)
-  }
+  async create(request: FastifyRequest<{ Body: { title: string } }>, reply: FastifyReply) {}
 
   async getAll(_request: FastifyRequest, reply: FastifyReply) {
killedBy: Todo Integration Tests should create a todo
statusReason: expected 200 to be 201 // Object.is equality

[Killed] BlockStatement
src/features/todo/todo.controller.ts:29:63
     return reply.status(201).send(result)
   }
 
-  async getAll(_request: FastifyRequest, reply: FastifyReply) {
-    const result = await this.getTodosUseCase.execute()
-    return reply.send(result)
-  }
+  async getAll(_request: FastifyRequest, reply: FastifyReply) {}
 
   async getById(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {
killedBy: Todo Integration Tests should get all todos
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/features/todo/todo.controller.ts:34:91
     return reply.send(result)
   }
 
-  async getById(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {
-    const result = await this.getTodoByIdUseCase.execute(request.params.id)
-    if (!result) {
-      throw new NotFoundError('Todo not found')
-    }
-    return reply.send(result)
-  }
+  async getById(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {}
 
   async update(
killedBy: Todo Integration Tests should get a todo by id
statusReason: Unexpected end of JSON input

[Killed] ConditionalExpression
src/features/todo/todo.controller.ts:36:9
 
   async getById(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {
     const result = await this.getTodoByIdUseCase.execute(request.params.id)
-    if (!result) {
+    if (false) {
       throw new NotFoundError('Todo not found')
     }
killedBy: Todo Integration Tests should delete a todo
statusReason: expected 200 to be 404 // Object.is equality

[Killed] ConditionalExpression
src/features/todo/todo.controller.ts:36:9
 
   async getById(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {
     const result = await this.getTodoByIdUseCase.execute(request.params.id)
-    if (!result) {
+    if (true) {
       throw new NotFoundError('Todo not found')
     }
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/features/todo/todo.controller.ts:48:5
       Body: { title?: string; completed?: boolean }
     }>,
     reply: FastifyReply,
-  ) {
-    const result = await this.updateTodoUseCase.execute(request.params.id, request.body)
-    if (!result) {
-      throw new NotFoundError('Todo not found')
-    }
-    return reply.send(result)
-  }
+  ) {}
 
   async delete(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {
killedBy: Todo Integration Tests should update a todo
statusReason: Unexpected end of JSON input

[Killed] ConditionalExpression
src/features/todo/todo.controller.ts:50:9
     reply: FastifyReply,
   ) {
     const result = await this.updateTodoUseCase.execute(request.params.id, request.body)
-    if (!result) {
+    if (true) {
       throw new NotFoundError('Todo not found')
     }
killedBy: Todo Integration Tests should update a todo
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/features/todo/todo.controller.ts:50:9
     reply: FastifyReply,
   ) {
     const result = await this.updateTodoUseCase.execute(request.params.id, request.body)
-    if (!result) {
+    if (result) {
       throw new NotFoundError('Todo not found')
     }
killedBy: Todo Integration Tests should update a todo
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/features/todo/todo.controller.ts:56:90
     return reply.send(result)
   }
 
-  async delete(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {
-    try {
-      await this.deleteTodoUseCase.execute(request.params.id)
-      return reply.status(204).send()
-    } catch (error) {
-      if (error instanceof Error && error.message.toLowerCase().includes('id')) {
-        throw new BadRequestError('Invalid ID')
-      }
-      throw error
-    }
-  }
+  async delete(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {}
 }
 
killedBy: Todo Integration Tests should delete a todo
statusReason: expected 200 to be 204 // Object.is equality

[Killed] BlockStatement
src/features/todo/todo.controller.ts:57:9
   }
 
   async delete(request: FastifyRequest<{ Params: { id: string } }>, reply: FastifyReply) {
-    try {
-      await this.deleteTodoUseCase.execute(request.params.id)
-      return reply.status(204).send()
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof Error && error.message.toLowerCase().includes('id')) {
         throw new BadRequestError('Invalid ID')
killedBy: Todo Integration Tests should delete a todo
statusReason: expected 200 to be 204 // Object.is equality

[Killed] BlockStatement
src/features/todo/todo.controller.ts:60:21
     try {
       await this.deleteTodoUseCase.execute(request.params.id)
       return reply.status(204).send()
-    } catch (error) {
-      if (error instanceof Error && error.message.toLowerCase().includes('id')) {
-        throw new BadRequestError('Invalid ID')
-      }
-      throw error
-    }
+    } catch (error) {}
   }
 }
killedBy: Todo Integration Tests should return 400 when deleting with invalid id
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/features/todo/todo.controller.ts:61:81
       await this.deleteTodoUseCase.execute(request.params.id)
       return reply.status(204).send()
     } catch (error) {
-      if (error instanceof Error && error.message.toLowerCase().includes('id')) {
-        throw new BadRequestError('Invalid ID')
-      }
+      if (error instanceof Error && error.message.toLowerCase().includes('id')) {}
       throw error
     }
killedBy: Todo Integration Tests should return 400 when deleting with invalid id
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/features/todo/todo.controller.ts:61:11
       await this.deleteTodoUseCase.execute(request.params.id)
       return reply.status(204).send()
     } catch (error) {
-      if (error instanceof Error && error.message.toLowerCase().includes('id')) {
+      if (false) {
         throw new BadRequestError('Invalid ID')
       }
killedBy: Todo Integration Tests should return 400 when deleting with invalid id
statusReason: expected 500 to be 400 // Object.is equality

[Survived] StringLiteral
src/features/todo/todo.controller.ts:62:35
       return reply.status(204).send()
     } catch (error) {
       if (error instanceof Error && error.message.toLowerCase().includes('id')) {
-        throw new BadRequestError('Invalid ID')
+        throw new BadRequestError("")
       }
       throw error
