[Killed] BlockStatement
src/features/todo/todo.route.ts:5:97
 import { TodoController } from './todo.controller.js'
 import type { TodoRepository } from '../../domain/todo-repository.js'
 
-export async function todoRoutes(app: FastifyInstance, options: { repository: TodoRepository }) {
-  const controller = new TodoController(options.repository)
-
-  app.post('/', { config: { public: true } }, controller.create.bind(controller))
-  app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
-  app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
-  app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
-  app.delete('/:id', { config: { public: true } }, controller.delete.bind(controller))
-}
+export async function todoRoutes(app: FastifyInstance, options: { repository: TodoRepository }) {}
 
killedBy: Todo Integration Tests should create a todo
statusReason: expected 401 to be 201 // Object.is equality

[Killed] BooleanLiteral
src/features/todo/todo.route.ts:8:37
 export async function todoRoutes(app: FastifyInstance, options: { repository: TodoRepository }) {
   const controller = new TodoController(options.repository)
 
-  app.post('/', { config: { public: true } }, controller.create.bind(controller))
+  app.post('/', { config: { public: false } }, controller.create.bind(controller))
   app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
   app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
killedBy: Todo Integration Tests should create a todo
statusReason: expected 401 to be 201 // Object.is equality

[Killed] BooleanLiteral
src/features/todo/todo.route.ts:9:36
   const controller = new TodoController(options.repository)
 
   app.post('/', { config: { public: true } }, controller.create.bind(controller))
-  app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
+  app.get('/', { config: { public: false } }, controller.getAll.bind(controller))
   app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
   app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
killedBy: Todo Integration Tests should get all todos
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/features/todo/todo.route.ts:9:26
   const controller = new TodoController(options.repository)
 
   app.post('/', { config: { public: true } }, controller.create.bind(controller))
-  app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
+  app.get('/', { config: {} }, controller.getAll.bind(controller))
   app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
   app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
killedBy: Todo Integration Tests should get all todos
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/features/todo/todo.route.ts:10:39
 
   app.post('/', { config: { public: true } }, controller.create.bind(controller))
   app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
-  app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
+  app.get('/:id', { config: { public: false } }, controller.getById.bind(controller))
   app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
   app.delete('/:id', { config: { public: true } }, controller.delete.bind(controller))
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 401 to be 200 // Object.is equality

[Killed] StringLiteral
src/features/todo/todo.route.ts:10:11
 
   app.post('/', { config: { public: true } }, controller.create.bind(controller))
   app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
-  app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
+  app.get("", { config: { public: true } }, controller.getById.bind(controller))
   app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
   app.delete('/:id', { config: { public: true } }, controller.delete.bind(controller))
killedBy: Todo Integration Tests should create a todo; Todo Integration Tests should get all todos; Todo Integration Tests should get a todo by id
statusReason: Method 'GET' already declared for route '/todos'

[Killed] BooleanLiteral
src/features/todo/todo.route.ts:11:39
   app.post('/', { config: { public: true } }, controller.create.bind(controller))
   app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
   app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
-  app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
+  app.put('/:id', { config: { public: false } }, controller.update.bind(controller))
   app.delete('/:id', { config: { public: true } }, controller.delete.bind(controller))
 }
killedBy: Todo Integration Tests should update a todo
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/features/todo/todo.route.ts:11:19
   app.post('/', { config: { public: true } }, controller.create.bind(controller))
   app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
   app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
-  app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
+  app.put('/:id', {}, controller.update.bind(controller))
   app.delete('/:id', { config: { public: true } }, controller.delete.bind(controller))
 }
killedBy: Todo Integration Tests should update a todo
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/features/todo/todo.route.ts:12:42
   app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
   app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
   app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
-  app.delete('/:id', { config: { public: true } }, controller.delete.bind(controller))
+  app.delete('/:id', { config: { public: false } }, controller.delete.bind(controller))
 }
 
killedBy: Todo Integration Tests should delete a todo
statusReason: expected 401 to be 204 // Object.is equality

[Killed] ObjectLiteral
src/features/todo/todo.route.ts:12:22
   app.get('/', { config: { public: true } }, controller.getAll.bind(controller))
   app.get('/:id', { config: { public: true } }, controller.getById.bind(controller))
   app.put('/:id', { config: { public: true } }, controller.update.bind(controller))
-  app.delete('/:id', { config: { public: true } }, controller.delete.bind(controller))
+  app.delete('/:id', {}, controller.delete.bind(controller))
 }
 
killedBy: Todo Integration Tests should delete a todo
statusReason: expected 401 to be 204 // Object.is equality
