[Killed] BlockStatement
src/infrastructure/in-memory-todo-repository.ts:8:41
 export class InMemoryTodoRepository implements TodoRepository {
   private readonly todos = new Map<string, Todo>()
 
-  async save(todo: Todo): Promise<void> {
-    const id = todo.toJSON().id
-    this.todos.set(id, todo)
-  }
+  async save(todo: Todo): Promise<void> {}
 
   async findById(id: TodoId): Promise<Todo | null> {
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/in-memory-todo-repository.ts:13:52
     this.todos.set(id, todo)
   }
 
-  async findById(id: TodoId): Promise<Todo | null> {
-    return this.todos.get(id.toString()) || null
-  }
+  async findById(id: TodoId): Promise<Todo | null> {}
 
   async findAll(): Promise<Todo[]> {
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/in-memory-todo-repository.ts:14:12
   }
 
   async findById(id: TodoId): Promise<Todo | null> {
-    return this.todos.get(id.toString()) || null
+    return true
   }
 
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/in-memory-todo-repository.ts:14:12
   }
 
   async findById(id: TodoId): Promise<Todo | null> {
-    return this.todos.get(id.toString()) || null
+    return false
   }
 
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/in-memory-todo-repository.ts:17:36
     return this.todos.get(id.toString()) || null
   }
 
-  async findAll(): Promise<Todo[]> {
-    return Array.from(this.todos.values())
-  }
+  async findAll(): Promise<Todo[]> {}
 
   async delete(id: TodoId): Promise<void> {
killedBy: Todo Integration Tests should get all todos
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/in-memory-todo-repository.ts:21:43
     return Array.from(this.todos.values())
   }
 
-  async delete(id: TodoId): Promise<void> {
-    this.todos.delete(id.toString())
-  }
+  async delete(id: TodoId): Promise<void> {}
 }
 
killedBy: Todo Integration Tests should delete a todo
statusReason: expected 200 to be 404 // Object.is equality
