[Survived] BlockStatement
src/plugins/cors.plugin.ts:4:73
 import type { FastifyInstance } from 'fastify'
 import fastifyCors from '@fastify/cors'
 
-export async function registerCors(app: FastifyInstance): Promise<void> {
-  await app.register(fastifyCors, {
-    origin: app.config.CORS_ORIGIN,
-  })
-}
+export async function registerCors(app: FastifyInstance): Promise<void> {}
 
