[Killed] ConditionalExpression
src/plugins/database.plugin.ts:15:7
   let uri = app.config.MONGODB_URI
   let mongod: { stop: () => Promise<boolean> } | null = null
 
-  if (app.config.USE_IN_MEMORY_DB) {
+  if (false) {
     app.log.info('Starting in-memory MongoDB server...')
     try {
killedBy: Todo Integration Tests should create a todo; Todo Integration Tests should get all todos; Todo Integration Tests should get a todo by id
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] BlockStatement
src/plugins/database.plugin.ts:15:36
   let uri = app.config.MONGODB_URI
   let mongod: { stop: () => Promise<boolean> } | null = null
 
-  if (app.config.USE_IN_MEMORY_DB) {
-    app.log.info('Starting in-memory MongoDB server...')
-    try {
-      const { MongoMemoryServer } = await import('mongodb-memory-server')
-      const server = await MongoMemoryServer.create()
-      mongod = server
-      uri = server.getUri()
-      app.log.info(`In-memory MongoDB server started at ${uri}`)
-    } catch (error) {
-      app.log.error(
-        error,
-        'Failed to start in-memory MongoDB server. Is mongodb-memory-server installed?',
-      )
-      throw error
-    }
-  }
+  if (app.config.USE_IN_MEMORY_DB) {}
 
   const client = new MongoClient(uri)
killedBy: buildApp should enable logger by default when no options provided
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
src/plugins/database.plugin.ts:16:18
   let mongod: { stop: () => Promise<boolean> } | null = null
 
   if (app.config.USE_IN_MEMORY_DB) {
-    app.log.info('Starting in-memory MongoDB server...')
+    app.log.info("")
     try {
       const { MongoMemoryServer } = await import('mongodb-memory-server')

[Killed] BlockStatement
src/plugins/database.plugin.ts:17:9
 
   if (app.config.USE_IN_MEMORY_DB) {
     app.log.info('Starting in-memory MongoDB server...')
-    try {
-      const { MongoMemoryServer } = await import('mongodb-memory-server')
-      const server = await MongoMemoryServer.create()
-      mongod = server
-      uri = server.getUri()
-      app.log.info(`In-memory MongoDB server started at ${uri}`)
-    } catch (error) {
+    try {} catch (error) {
       app.log.error(
         error,
killedBy: Todo Integration Tests should create a todo; Todo Integration Tests should get all todos; Todo Integration Tests should get a todo by id
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Survived] StringLiteral
src/plugins/database.plugin.ts:22:20
       const server = await MongoMemoryServer.create()
       mongod = server
       uri = server.getUri()
-      app.log.info(`In-memory MongoDB server started at ${uri}`)
+      app.log.info(``)
     } catch (error) {
       app.log.error(

[NoCoverage] BlockStatement
src/plugins/database.plugin.ts:23:21
       mongod = server
       uri = server.getUri()
       app.log.info(`In-memory MongoDB server started at ${uri}`)
-    } catch (error) {
-      app.log.error(
-        error,
-        'Failed to start in-memory MongoDB server. Is mongodb-memory-server installed?',
-      )
-      throw error
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/plugins/database.plugin.ts:34:7
 
   const client = new MongoClient(uri)
 
-  try {
-    await client.connect()
-    app.log.info('Connected to MongoDB')
-
-    const db = client.db()
-    setDatabase(db)
-
-    app.decorate('db', db)
-    app.decorate('mongoClient', client)
-
-    app.addHook('onClose', async () => {
-      app.log.info('Closing MongoDB connection...')
-      await client.close()
-
-      if (mongod) {
-        app.log.info('Stopping in-memory MongoDB server...')
-        await mongod.stop()
-      }
-    })
-  } catch (error) {
+  try {} catch (error) {
     app.log.error(error, 'Failed to connect to MongoDB')
     throw error
killedBy: GET /health should return 200 with status ok
statusReason: expected 503 to be 200 // Object.is equality

[Survived] StringLiteral
src/plugins/database.plugin.ts:42:18
     setDatabase(db)
 
     app.decorate('db', db)
-    app.decorate('mongoClient', client)
+    app.decorate("", client)
 
     app.addHook('onClose', async () => {

[Survived] BlockStatement
src/plugins/database.plugin.ts:44:40
     app.decorate('db', db)
     app.decorate('mongoClient', client)
 
-    app.addHook('onClose', async () => {
-      app.log.info('Closing MongoDB connection...')
-      await client.close()
-
-      if (mongod) {
-        app.log.info('Stopping in-memory MongoDB server...')
-        await mongod.stop()
-      }
-    })
+    app.addHook('onClose', async () => {})
   } catch (error) {
     app.log.error(error, 'Failed to connect to MongoDB')

[Killed] StringLiteral
src/plugins/database.plugin.ts:44:17
     app.decorate('db', db)
     app.decorate('mongoClient', client)
 
-    app.addHook('onClose', async () => {
+    app.addHook("", async () => {
       app.log.info('Closing MongoDB connection...')
       await client.close()
killedBy: buildApp should enable logger by default when no options provided
statusReason: hook not supported!

[Survived] StringLiteral
src/plugins/database.plugin.ts:45:20
     app.decorate('mongoClient', client)
 
     app.addHook('onClose', async () => {
-      app.log.info('Closing MongoDB connection...')
+      app.log.info("")
       await client.close()
 

[Survived] BlockStatement
src/plugins/database.plugin.ts:48:19
       app.log.info('Closing MongoDB connection...')
       await client.close()
 
-      if (mongod) {
-        app.log.info('Stopping in-memory MongoDB server...')
-        await mongod.stop()
-      }
+      if (mongod) {}
     })
   } catch (error) {

[Survived] ConditionalExpression
src/plugins/database.plugin.ts:48:11
       app.log.info('Closing MongoDB connection...')
       await client.close()
 
-      if (mongod) {
+      if (false) {
         app.log.info('Stopping in-memory MongoDB server...')
         await mongod.stop()

[NoCoverage] BlockStatement
src/plugins/database.plugin.ts:53:19
         await mongod.stop()
       }
     })
-  } catch (error) {
-    app.log.error(error, 'Failed to connect to MongoDB')
-    throw error
-  }
+  } catch (error) {}
 }
 
