[Survived] BlockStatement
src/plugins/helmet.plugin.ts:4:75
 import type { FastifyInstance } from 'fastify'
 import fastifyHelmet from '@fastify/helmet'
 
-export async function registerHelmet(app: FastifyInstance): Promise<void> {
-  await app.register(fastifyHelmet)
-}
+export async function registerHelmet(app: FastifyInstance): Promise<void> {}
 
