[Survived] BlockStatement
src/plugins/rate-limit.plugin.ts:7:78
 const MAX_REQUESTS_PER_WINDOW = 100
 const TIME_WINDOW_MS = 60_000
 
-export async function registerRateLimit(app: FastifyInstance): Promise<void> {
-  await app.register(fastifyRateLimit, {
-    max: MAX_REQUESTS_PER_WINDOW,
-    timeWindow: TIME_WINDOW_MS,
-  })
-}
+export async function registerRateLimit(app: FastifyInstance): Promise<void> {}
 
