[Killed] ObjectLiteral
src/plugins/swagger.plugin.ts:7:14
 
 export async function registerSwagger(app: FastifyInstance): Promise<void> {
   await app.register(fastifySwagger, {
-    openapi: {
-      info: {
-        title: 'Todo List API',
-        description: 'Todo List API documentation',
-        version: '0.1.0',
-      },
-      servers: [
-        {
-          url: 'http://localhost:3000',
-          description: 'Development server',
-        },
-      ],
-    },
+    openapi: {},
   })
 
killedBy: Swagger Documentation should serve OpenAPI JSON at /docs/json
statusReason: expected '@fastify/swagger' to be 'Todo List API' // Object.is equality

[Killed] ObjectLiteral
src/plugins/swagger.plugin.ts:8:13
 export async function registerSwagger(app: FastifyInstance): Promise<void> {
   await app.register(fastifySwagger, {
     openapi: {
-      info: {
-        title: 'Todo List API',
-        description: 'Todo List API documentation',
-        version: '0.1.0',
-      },
+      info: {},
       servers: [
         {
killedBy: Swagger Documentation should serve OpenAPI JSON at /docs/json
statusReason: expected undefined to be 'Todo List API' // Object.is equality

[Killed] ObjectLiteral
src/plugins/swagger.plugin.ts:22:40
     },
   })
 
-  await app.register(fastifySwaggerUi, {
-    routePrefix: '/docs',
-    uiConfig: {
-      docExpansion: 'list',
-      deepLinking: false,
-    },
-    staticCSP: true,
-    transformStaticCSP: (header) => header,
-  })
+  await app.register(fastifySwaggerUi, {})
 }
 
killedBy: Swagger Documentation should serve Swagger UI at /docs
statusReason: expected 404 to be 200 // Object.is equality

[Survived] StringLiteral
src/plugins/swagger.plugin.ts:25:21
   await app.register(fastifySwaggerUi, {
     routePrefix: '/docs',
     uiConfig: {
-      docExpansion: 'list',
+      docExpansion: "",
       deepLinking: false,
     },

[Survived] BooleanLiteral
src/plugins/swagger.plugin.ts:26:20
     routePrefix: '/docs',
     uiConfig: {
       docExpansion: 'list',
-      deepLinking: false,
+      deepLinking: true,
     },
     staticCSP: true,

[Survived] BooleanLiteral
src/plugins/swagger.plugin.ts:28:16
       docExpansion: 'list',
       deepLinking: false,
     },
-    staticCSP: true,
+    staticCSP: false,
     transformStaticCSP: (header) => header,
   })

[Survived] ArrowFunction
src/plugins/swagger.plugin.ts:29:25
       deepLinking: false,
     },
     staticCSP: true,
-    transformStaticCSP: (header) => header,
+    transformStaticCSP: () => undefined,
   })
 }
