[Killed] BlockStatement
src/plugins/todo.plugin.ts:6:49
 import { InMemoryTodoRepository } from '../infrastructure/in-memory-todo-repository.js'
 import { todoRoutes } from '../features/todo/todo.route.js'
 
-async function todoPlugin(app: FastifyInstance) {
-  const repository = new InMemoryTodoRepository()
-
-  await app.register(todoRoutes, {
-    repository,
-    prefix: '/todos',
-  })
-}
+async function todoPlugin(app: FastifyInstance) {}
 
 export const registerTodo = fp(todoPlugin, {
killedBy: Todo Integration Tests should create a todo
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ObjectLiteral
src/plugins/todo.plugin.ts:9:34
 async function todoPlugin(app: FastifyInstance) {
   const repository = new InMemoryTodoRepository()
 
-  await app.register(todoRoutes, {
-    repository,
-    prefix: '/todos',
-  })
+  await app.register(todoRoutes, {})
 }
 
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 404 to be 401 // Object.is equality

[Survived] StringLiteral
src/plugins/todo.plugin.ts:16:9
 }
 
 export const registerTodo = fp(todoPlugin, {
-  name: 'todo-plugin',
+  name: "",
 })
 
