[Killed] BlockStatement
src/shared/database.ts:6:49
 
 let db: Db | null = null
 
-export function setDatabase(database: Db): void {
-  db = database
-}
+export function setDatabase(database: Db): void {}
 
 export function getUsersCollection(): Collection<User> {
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BlockStatement
src/shared/database.ts:10:56
   db = database
 }
 
-export function getUsersCollection(): Collection<User> {
-  if (!db) {
-    throw new Error('Database not connected')
-  }
-  return db.collection<User>('users')
-}
+export function getUsersCollection(): Collection<User> {}
 
 export const userRepository = {
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BlockStatement
src/shared/database.ts:11:12
 }
 
 export function getUsersCollection(): Collection<User> {
-  if (!db) {
-    throw new Error('Database not connected')
-  }
+  if (!db) {}
   return db.collection<User>('users')
 }
killedBy: Shared Database should throw error if database not connected
statusReason: expected [Function] to throw error including 'Database not connected' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/shared/database.ts:11:7
 }
 
 export function getUsersCollection(): Collection<User> {
-  if (!db) {
+  if (false) {
     throw new Error('Database not connected')
   }
killedBy: Shared Database should throw error if database not connected
statusReason: expected [Function] to throw error including 'Database not connected' but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/shared/database.ts:18:58
 }
 
 export const userRepository = {
-  async findByEmail(email: string): Promise<User | null> {
-    return getUsersCollection().findOne({ email })
-  },
+  async findByEmail(email: string): Promise<User | null> {},
 
   async create(input: CreateUserInput): Promise<User> {
killedBy: Authentication Integration POST /api/auth/register should return 400 when email already exists
statusReason: expected 201 to be 400 // Object.is equality

[Killed] BlockStatement
src/shared/database.ts:22:55
     return getUsersCollection().findOne({ email })
   },
 
-  async create(input: CreateUserInput): Promise<User> {
-    const now = new Date()
-    const user: User = {
-      id: Math.random().toString(36).substring(2, 15), // Placeholder ID generation
-      ...input,
-      createdAt: now,
-      updatedAt: now,
-    }
-
-    await getUsersCollection().insertOne(user)
-    return user
-  },
+  async create(input: CreateUserInput): Promise<User> {},
 }
 
killedBy: Authentication Integration POST /api/auth/register should register a new user successfully
statusReason: expected 500 to be 201 // Object.is equality

[Survived] MethodExpression
src/shared/database.ts:25:11
   async create(input: CreateUserInput): Promise<User> {
     const now = new Date()
     const user: User = {
-      id: Math.random().toString(36).substring(2, 15), // Placeholder ID generation
+      id: Math.random().toString(36), // Placeholder ID generation
       ...input,
       createdAt: now,
