[Killed] BlockStatement
src/shared/errors/error-handler.ts:11:58
   message: string
 }
 
-function isValidationError(error: FastifyError): boolean {
-  return error.validation !== undefined
-}
+function isValidationError(error: FastifyError): boolean {}
 
 function buildValidationResponse(error: FastifyError): ErrorResponse {
killedBy: error handler should return 400 for validation errors
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/shared/errors/error-handler.ts:12:10
 }
 
 function isValidationError(error: FastifyError): boolean {
-  return error.validation !== undefined
+  return false
 }
 
killedBy: error handler should return 400 for validation errors
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/shared/errors/error-handler.ts:12:10
 }
 
 function isValidationError(error: FastifyError): boolean {
-  return error.validation !== undefined
+  return true
 }
 
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 400 to be 401 // Object.is equality

[Killed] BlockStatement
src/shared/errors/error-handler.ts:15:70
   return error.validation !== undefined
 }
 
-function buildValidationResponse(error: FastifyError): ErrorResponse {
-  return {
-    statusCode: 400,
-    error: 'Bad Request',
-    message: error.message,
-  }
-}
+function buildValidationResponse(error: FastifyError): ErrorResponse {}
 
 function buildHttpErrorResponse(error: HttpError): ErrorResponse {
killedBy: error handler should return 400 for validation errors
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
src/shared/errors/error-handler.ts:23:66
   }
 }
 
-function buildHttpErrorResponse(error: HttpError): ErrorResponse {
-  return {
-    statusCode: error.statusCode,
-    error: error.name,
-    message: error.message,
-  }
-}
+function buildHttpErrorResponse(error: HttpError): ErrorResponse {}
 
 function buildInternalErrorResponse(): ErrorResponse {
killedBy: Todo Integration Tests should delete a todo
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BlockStatement
src/shared/errors/error-handler.ts:31:54
   }
 }
 
-function buildInternalErrorResponse(): ErrorResponse {
-  return {
-    statusCode: 500,
-    error: 'Internal Server Error',
-    message: 'An unexpected error occurred',
-  }
-}
+function buildInternalErrorResponse(): ErrorResponse {}
 
 export function registerErrorHandler(app: FastifyInstance): void {
killedBy: error handler should return 500 for unexpected errors
statusReason: expected { statusCode: 500, …(2) } to deeply equal { statusCode: 500, …(2) }

[Killed] BlockStatement
src/shared/errors/error-handler.ts:39:66
   }
 }
 
-export function registerErrorHandler(app: FastifyInstance): void {
-  app.setErrorHandler((error, _request, reply) => {
-    if (isValidationError(error as FastifyError)) {
-      const response = buildValidationResponse(error as FastifyError)
-      return reply.status(response.statusCode).send(response)
-    }
-
-    if (error instanceof HttpError) {
-      const response = buildHttpErrorResponse(error)
-      return reply.status(response.statusCode).send(response)
-    }
-
-    app.log.error(error)
-    const response = buildInternalErrorResponse()
-    return reply.status(response.statusCode).send(response)
-  })
-}
+export function registerErrorHandler(app: FastifyInstance): void {}
 
killedBy: error handler should return consistent JSON for HttpError
statusReason: expected { statusCode: 404, …(2) } to deeply equal { statusCode: 404, …(2) }

[Killed] BlockStatement
src/shared/errors/error-handler.ts:40:51
 }
 
 export function registerErrorHandler(app: FastifyInstance): void {
-  app.setErrorHandler((error, _request, reply) => {
-    if (isValidationError(error as FastifyError)) {
-      const response = buildValidationResponse(error as FastifyError)
-      return reply.status(response.statusCode).send(response)
-    }
-
-    if (error instanceof HttpError) {
-      const response = buildHttpErrorResponse(error)
-      return reply.status(response.statusCode).send(response)
-    }
-
-    app.log.error(error)
-    const response = buildInternalErrorResponse()
-    return reply.status(response.statusCode).send(response)
-  })
+  app.setErrorHandler((error, _request, reply) => {})
 }
 
killedBy: error handler should return consistent JSON for HttpError
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/shared/errors/error-handler.ts:41:9
 
 export function registerErrorHandler(app: FastifyInstance): void {
   app.setErrorHandler((error, _request, reply) => {
-    if (isValidationError(error as FastifyError)) {
+    if (true) {
       const response = buildValidationResponse(error as FastifyError)
       return reply.status(response.statusCode).send(response)
killedBy: Authentication Integration POST /api/auth/login should return 401 with invalid credentials
statusReason: expected 400 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/shared/errors/error-handler.ts:41:9
 
 export function registerErrorHandler(app: FastifyInstance): void {
   app.setErrorHandler((error, _request, reply) => {
-    if (isValidationError(error as FastifyError)) {
+    if (false) {
       const response = buildValidationResponse(error as FastifyError)
       return reply.status(response.statusCode).send(response)
killedBy: error handler should return 400 for validation errors
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
src/shared/errors/error-handler.ts:46:37
       return reply.status(response.statusCode).send(response)
     }
 
-    if (error instanceof HttpError) {
-      const response = buildHttpErrorResponse(error)
-      return reply.status(response.statusCode).send(response)
-    }
+    if (error instanceof HttpError) {}
 
     app.log.error(error)
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 500 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/shared/errors/error-handler.ts:46:9
       return reply.status(response.statusCode).send(response)
     }
 
-    if (error instanceof HttpError) {
+    if (false) {
       const response = buildHttpErrorResponse(error)
       return reply.status(response.statusCode).send(response)
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 500 to be 401 // Object.is equality
