[Killed] BlockStatement
src/shared/errors/http-error.ts:4:52
 export class HttpError extends Error {
   public readonly statusCode: number
 
-  constructor(statusCode: number, message: string) {
-    super(message)
-    this.statusCode = statusCode
-    this.name = 'HttpError'
-  }
+  constructor(statusCode: number, message: string) {}
 }
 
killedBy: Authentication Integration POST /api/auth/register should return 400 when email already exists
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
src/shared/errors/http-error.ts:12:32
 }
 
 export class BadRequestError extends HttpError {
-  constructor(message: string) {
-    super(400, message)
-    this.name = 'BadRequestError'
-  }
+  constructor(message: string) {}
 }
 
killedBy: Authentication Integration POST /api/auth/register should return 400 when email already exists
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
src/shared/errors/http-error.ts:19:32
 }
 
 export class UnauthorizedError extends HttpError {
-  constructor(message: string) {
-    super(401, message)
-    this.name = 'UnauthorizedError'
-  }
+  constructor(message: string) {}
 }
 
killedBy: unauthenticated routes should return 401 for non-public routes
statusReason: expected 500 to be 401 // Object.is equality

[Killed] BlockStatement
src/shared/errors/http-error.ts:26:32
 }
 
 export class NotFoundError extends HttpError {
-  constructor(message: string) {
-    super(404, message)
-    this.name = 'NotFoundError'
-  }
+  constructor(message: string) {}
 }
 
killedBy: error handler should return consistent JSON for HttpError
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BlockStatement
src/shared/errors/http-error.ts:33:32
 }
 
 export class ConflictError extends HttpError {
-  constructor(message: string) {
-    super(409, message)
-    this.name = 'ConflictError'
-  }
+  constructor(message: string) {}
 }
 
killedBy: ConflictError should have status code 409
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/shared/errors/http-error.ts:35:17
 export class ConflictError extends HttpError {
   constructor(message: string) {
     super(409, message)
-    this.name = 'ConflictError'
+    this.name = ""
   }
 }
killedBy: ConflictError should have status code 409
statusReason: expected '' to be 'ConflictError' // Object.is equality

[Killed] BlockStatement
src/shared/errors/http-error.ts:40:32
 }
 
 export class InternalServerError extends HttpError {
-  constructor(message: string) {
-    super(500, message)
-    this.name = 'InternalServerError'
-  }
+  constructor(message: string) {}
 }
 
killedBy: InternalServerError should have status code 500
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
