[Killed] BlockStatement
src/use-cases/create-todo.ts:12:41
 export class CreateTodoUseCase {
   constructor(private readonly repository: TodoRepository) {}
 
-  async execute(input: CreateTodoInput) {
-    const title = TodoTitle.fromString(input.title)
-    const todo = Todo.create(title)
-    await this.repository.save(todo)
-    return todo.toJSON()
-  }
+  async execute(input: CreateTodoInput) {}
 }
 
killedBy: Todo Integration Tests should create a todo
statusReason: Unexpected end of JSON input
