[Killed] BlockStatement
src/use-cases/delete-todo.ts:7:29
 export class DeleteTodoUseCase {
   constructor(private readonly repository: TodoRepository) {}
 
-  async execute(id: string) {
-    const todoId = TodoId.fromString(id)
-    await this.repository.delete(todoId)
-  }
+  async execute(id: string) {}
 }
 
killedBy: Todo Integration Tests should delete a todo
statusReason: expected 200 to be 404 // Object.is equality
