[Killed] BlockStatement
src/use-cases/get-todos.ts:7:19
 export class GetTodosUseCase {
   constructor(private readonly repository: TodoRepository) {}
 
-  async execute() {
-    const todos = await this.repository.findAll()
-    return todos.map((todo) => todo.toJSON())
-  }
+  async execute() {}
 }
 
killedBy: Todo Integration Tests should get all todos
statusReason: Unexpected end of JSON input

[Killed] ArrowFunction
src/use-cases/get-todos.ts:9:22
 
   async execute() {
     const todos = await this.repository.findAll()
-    return todos.map((todo) => todo.toJSON())
+    return todos.map(() => undefined)
   }
 }
killedBy: Todo Integration Tests should get all todos
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/use-cases/get-todos.ts:16:29
 export class GetTodoByIdUseCase {
   constructor(private readonly repository: TodoRepository) {}
 
-  async execute(id: string) {
-    try {
-      const todoId = TodoId.fromString(id)
-      const todo = await this.repository.findById(todoId)
-      return todo ? todo.toJSON() : null
-    } catch {
-      return null
-    }
-  }
+  async execute(id: string) {}
 }
 
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/use-cases/get-todos.ts:17:9
   constructor(private readonly repository: TodoRepository) {}
 
   async execute(id: string) {
-    try {
-      const todoId = TodoId.fromString(id)
-      const todo = await this.repository.findById(todoId)
-      return todo ? todo.toJSON() : null
-    } catch {
+    try {} catch {
       return null
     }
killedBy: Todo Integration Tests should get a todo by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/use-cases/get-todos.ts:21:13
       const todoId = TodoId.fromString(id)
       const todo = await this.repository.findById(todoId)
       return todo ? todo.toJSON() : null
-    } catch {
-      return null
-    }
+    } catch {}
   }
 }
killedBy: GetTodos Use Cases GetTodoByIdUseCase should return null if todo not found
statusReason: expected undefined to be null
