[Killed] BlockStatement
src/use-cases/update-todo.ts:13:53
 export class UpdateTodoUseCase {
   constructor(private readonly repository: TodoRepository) {}
 
-  async execute(id: string, input: UpdateTodoInput) {
-    try {
-      const todoId = TodoId.fromString(id)
-      const todo = await this.repository.findById(todoId)
-
-      if (!todo) return null
-
-      if (input.title) {
-        todo.updateTitle(TodoTitle.fromString(input.title))
-      }
-
-      if (input.completed === true) {
-        todo.complete()
-      }
-
-      await this.repository.save(todo)
-      return todo.toJSON()
-    } catch {
-      return null
-    }
-  }
+  async execute(id: string, input: UpdateTodoInput) {}
 }
 
killedBy: Todo Integration Tests should update a todo
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/use-cases/update-todo.ts:14:9
   constructor(private readonly repository: TodoRepository) {}
 
   async execute(id: string, input: UpdateTodoInput) {
-    try {
-      const todoId = TodoId.fromString(id)
-      const todo = await this.repository.findById(todoId)
-
-      if (!todo) return null
-
-      if (input.title) {
-        todo.updateTitle(TodoTitle.fromString(input.title))
-      }
-
-      if (input.completed === true) {
-        todo.complete()
-      }
-
-      await this.repository.save(todo)
-      return todo.toJSON()
-    } catch {
+    try {} catch {
       return null
     }
killedBy: Todo Integration Tests should update a todo
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/use-cases/update-todo.ts:18:11
       const todoId = TodoId.fromString(id)
       const todo = await this.repository.findById(todoId)
 
-      if (!todo) return null
+      if (true) return null
 
       if (input.title) {
killedBy: Todo Integration Tests should update a todo
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/use-cases/update-todo.ts:18:11
       const todoId = TodoId.fromString(id)
       const todo = await this.repository.findById(todoId)
 
-      if (!todo) return null
+      if (todo) return null
 
       if (input.title) {
killedBy: Todo Integration Tests should update a todo
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/use-cases/update-todo.ts:20:11
 
       if (!todo) return null
 
-      if (input.title) {
+      if (true) {
         todo.updateTitle(TodoTitle.fromString(input.title))
       }
killedBy: UpdateTodoUseCase should update only completed status
statusReason: expected undefined to be 'Same title' // Object.is equality

[Killed] BlockStatement
src/use-cases/update-todo.ts:20:24
 
       if (!todo) return null
 
-      if (input.title) {
-        todo.updateTitle(TodoTitle.fromString(input.title))
-      }
+      if (input.title) {}
 
       if (input.completed === true) {
killedBy: Todo Integration Tests should update a todo
statusReason: expected 'Update me' to be 'Updated title' // Object.is equality

[Killed] ConditionalExpression
src/use-cases/update-todo.ts:24:11
         todo.updateTitle(TodoTitle.fromString(input.title))
       }
 
-      if (input.completed === true) {
+      if (true) {
         todo.complete()
       }
killedBy: UpdateTodoUseCase should update only title
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/use-cases/update-todo.ts:24:11
         todo.updateTitle(TodoTitle.fromString(input.title))
       }
 
-      if (input.completed === true) {
+      if (input.completed !== true) {
         todo.complete()
       }
killedBy: Todo Integration Tests should update a todo
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/use-cases/update-todo.ts:30:13
 
       await this.repository.save(todo)
       return todo.toJSON()
-    } catch {
-      return null
-    }
+    } catch {}
   }
 }
killedBy: UpdateTodoUseCase should return null if id is invalid
statusReason: expected undefined to be null
